<template>
    <div class="hb_agreeMent">
        <backBtn pageName="《用户注册服务协议》" :type="type" :params="{'phoneNum':phoneNum,'inviteCode':inviteCode,'type':bindType}"></backBtn>
        <p class="title">《用户注册服务协议》</p>
        <p class="content">特别提示：</p>
        <p class="bold content">
            1.请您（以下亦称“用户”）仔细阅读本协议全部条款，并确认您已完全了解本协议之规定。<br>
            2.未成年人应当在监护人陪同和指导下阅读本协议，并在使用本协议项下服务前取得监护人的同意，若您不具备前述与您行为相适应的民事行为能力，则您及您的监护人应依照法律规定承担因此而导致的一切后果。<br>
            3.本条款可由海豹日记随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，用户可在本APP中查阅最新版协议条款。在修改协议条款后，如果用户不接受修改后的条款，请立即停止使用海豹日记提供的服务，用户继续使用海豹日记提供的服务将被视为接受修改后的协议。本 app 仅是为用户提供电子商务平台服务的媒介，不因本平台服务与用户发生任何直接商品交易，不是用户之间或用户与第三人之间发生的商品买卖或其它法律关系的主体。<br>
            4.海豹日记及其提供的网上交易平台仅作为淘宝天猫商家或其他合作商家提供产品及产品信息的展示平台。对于海豹日记网上交易平台上的产品和信息，海豹日记仅具有和包括海豹日记用户在内的普通消费者相同程度的信息获取能力，不具备保证淘宝天猫商家或其他合作商家相关产品信息的真实性、准确性、合法性和有效性，以及交易双方履行其在买卖协议项下的各项义务的能力。<br>
            5.本协议最终解释权归海豹日记所有。
        </p>
        <p class="content p60">
            请认真阅读本《用户注册服务协议》（以下简称“协议”），确保您充分理解本协议中各条款。
        </p>
        <p class="bold content p60">一、定义</p>
        <p class="content p60">
            1.1本协议约束海豹日记与用户之间关于“海豹日记APP”软件服务（简称“服务”）的权利义务。本用户协议所述“海豹日记”指长沙冠博网络科技有限公司，“用户”指注册、登录或使用海豹日记app的个人。<br>
            1.2本协议内容包括协议正文及海豹日记根据本协议所制定和修订的相关管理规范。
        </p>
        <p class="bold content p60">二、账号的注册</p>
        <p class="content p60">
            2.1您需要注册一个“海豹日记”账号，并按照“海豹日记”的要求为该账号设置密码，账号应当使用手机号码绑定注册，请使用尚未与“海豹日记”账号绑定的手机号码，以及未被海豹日记根据本协议封禁的手机号码进行注册。您可依照“海豹日记”的要求修改您的账号密码、昵称、登录所使用的手机号等信息。<br>
            2.2您注册账号时，应按照“海豹日记”的提示及要求填写或提供资料、信息，并确保用户身份及信息的真实性、正确性和完整性；如果资料发生变化，您应及时更改。您同意并承诺：<br>
            2.2.1不故意冒用他人信息为您注册账号；<br>
            2.2.2未经他人合法授权不以他人名义注册账号；<br>
            2.2.3不使用色情、暴力或侮辱、诽谤他人等违反公序良俗的词语注册账号；<br>
            2.2.4不进行其他不当的账号注册的行为。
        </p>
        <p class="content p60">
            如您违反前述规定，“海豹日记”有权随时拒绝、限制您使用该账号，或者注销该账号。
        </p>
        <p class="content p60">
            2.3“海豹日记”是一款电子商务交易平台的APP产品，用户注册时应当授权海豹日记公开及使用其个人信息方可成功注册“海豹日记”账号。故用户完成注册即表明用户同意海豹日记提取、公开及使用用户的信息。<br>
            2.4鉴于“海豹日记”账号的绑定注册方式，您同意海豹日记在注册时将允许您的手机号码及手机设备识别码等信息用于注册。<br>
            2.5在用户注册及使用本服务时，海豹日记需要搜集能识别用户身份的个人信息以便海豹日记可以在必要时联系用户，<br>
            或为用户提供更好的使用体验。海豹日记同意对这些信息的使用将受限于第三条用户个人隐私信息保护的约束。<br>
            2.6海豹日记和用户均有权随时解除或终止本协议，互相无须因解除或终止本协议承担任何责任，具体可联系海豹日记工作人员了解详情。
        </p>
        <p class="bold content p60">三、用户个人隐私信息保护</p>
        <p class="content p60">
            3.1如果海豹日记发现或收到他人举报或投诉用户违反本协议约定的，海豹日记有权不经通知随时对相关内容，包括但不限于用户资料、发贴记录进行审查、删除，并视情节轻重对违规账号处以包括但不限于警告、账号封禁 、设备封禁 、功能封禁的处罚，且通知用户处理结果。<br>
            3.2因违反用户协议被封禁的用户，可以自行与海豹日记联系。其中，被实施功能封禁的用户会在封禁期届满后自动恢复被封禁功能。被封禁用户可提交申诉，海豹日记将对申诉进行审查，并自行合理判断决定是否变更处罚措施。<br>
            3.3用户理解并同意，海豹日记有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应承担由此而产生的一切法律责任。<br>
            3.4用户理解并同意，因用户违反本协议约定或发生其它过错，导致或产生的任何第三方向海豹日记或其合作公司、关联公司主张任何索赔、要求，如果造成海豹日记或其合作公司、关联公司发生的任何损失，包括合理的律师费，用户应当赔偿海豹日记与合作公司、关联公司，并使之免受损害。
        </p>
        <p class="bold content p60">四、用户发布内容规范</p>
        <p class="content p60">
            4.1本条所述内容是指用户使用海豹日记的过程中所制作、上载、复制、发布、传播的任何内容，包括但不限于账号头像、名称、用户说明等注册信息及认证资料，或文字、语音、图片、视频、图文等 发送、回复或自动回复消息和相关链接页面，以及其他使用账号或本服务所产生的内容。<br>
            4.2用户不得利用“海豹日记”账号或本服务制作、上载、复制、发布、传播如下法律、法规和政策禁止的内容：<br>
            (1) 反对宪法所确定的基本原则的；<br>
            (2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；<br>
            (3) 损害国家荣誉和利益的；<br>
            (4) 煽动民族仇恨、民族歧视，破坏民族团结的；<br>
            (5) 破坏国家宗教政策，宣扬邪教和封建迷信的；<br>
            (6) 散布谣言，扰乱社会秩序，破坏社会稳定的；<br>
            (7) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；<br>
            (8) 侮辱或者诽谤他人，侵害他人合法权益的；<br>
            (9) 含有法律、行政法规禁止的其他内容的信息。<br>
            4.3用户不得利用“海豹日记”账号或本服务制作、上载、复制、发布、传播如下干扰“海豹日记”正常运营，以及侵犯其他用户或 第三方合法权益的内容：<br>
            (1) 含有任何性或性暗示的；<br>
            (2) 含有辱骂、恐吓、威胁内容的；<br>
            (3) 含有骚扰、垃圾广告、恶意信息、诱骗信息的；<br>
            (4) 涉及他人隐私、个人信息或资料的；<br>
            (5) 侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的；<br>
            (6) 含有其他干扰本服务正常运营和侵犯其他用户或第三方合法权益内容的信息。
        </p>
        <p class="bold content p60">五、使用规则</p>
        <p class="content p60">
            5.1用户在本服务中或通过本服务所传送、发布的任何内容并不反映或代表，也不得被视为反映或代表海豹日记的观点、立场或政策，海豹日记对此不承担任何责任。<br>
            5.2用户不得利用“海豹日记”账号或本服务进行如下行为：<br>
            (1) 提交、发布虚假信息，或盗用他人头像或资料，冒充、利用他人名义的；<br>
            (2) 虚构事实、隐瞒真相以误导、欺骗他人的；<br>
            (3) 利用技术手段批量建立虚假账号的；<br>
            (4) 利用“海豹日记”账号或本服务从事任何违法犯罪活动的；<br>
            (5) 制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播，无论这些行为是否为商业目的；<br>
            (6) 其他违反法律法规规定、侵犯其他用户合法权益、干扰“海豹日记”正常运营或海豹日记未明示授权的行为。<br>
            5.3用户须对利用“海豹日记”账号或本服务传送信息的真实性、合法性、无害性、准确性、有效性等全权负责。如因此给海豹日记或第三方造成损害的，用户应当依法予以赔偿。<br>
            5.4海豹日记提供的服务中可能包括广告，用户同意在使用过程中显示海豹日记和第三方供应商、合作伙伴提供的广告。
        </p>
        <p class="bold content p60">六、海豹日记平台说明</p>
        <p class="content p60 b500">
            6.1海豹日记作为电子商务交易平台，遵循以下原则：<br>
            (1)从不创造、编辑、修改海豹日记买家登录的内容；<br>
            (2)买家在海豹日记电商平台商品成交后，海豹日记不负责运送、储存或递交，商品直接从淘宝天猫商家或其他合作商家转移到海豹日记买家手中，商品本身也从不为海豹日记所持有或处于海豹日记的控制范围内；<br>
            (3)海豹日记电商平台从不允许买卖双方进行线下交易，对于违反规定的交易行为不承担任何责任；<br>
            (4)海豹日记电商平台不对第三方知识产权权利人的产品，商标权，著作权，专利权，经销权和价格体系具有专业知识；<br>
            6.2 海豹日记及其提供的网上交易平台仅作为淘宝天猫商家或其他合作商家提供产品及产品信息的展示平台。<br>
            6.3对于海豹日记网上交易平台上的产品和信息，海豹日记不具备保证淘宝天猫商家或其他合作商家相关产品信息的真实性、准确性、合法性、时效性和有效性，以及交易双方履行其在买卖协议项下的各项义务的能力，但海豹日记网上交易平台另行公示商品售后服务详情的，则以公示为准。<br>
            6.4如用户在购物过程中有任何疑问或与商家产生纠纷的，用户可以通过海豹日记官方渠道进行咨询和投诉，海豹日记将依据有关法律法规之规定对商品和服务质量进行监督，维护用户权益。<br>
            6.5因淘宝天猫商家与参与交易的海豹日记买家之间的交易行为引起的任何法律纠纷，包括但不限于投诉、起诉、举报及税赋等，均由参与交易的双方解决，海豹日记无义务参与或解决海豹日记买家与淘宝天猫商家的争议。但如果淘宝天猫商家怠于履行义务时，海豹日记有权介入淘宝天猫商家与海豹日记买家间的争议，依据一般人的认知程度对该争议进行判断和处置。
        </p>
    </div>
</template>
<script>
import backBtn from "@/components/backBtn"
export default {
    data(){
        return {
            type:'',
            phoneNum:'',
            inviteCode:'',
            bindType:''
        }
    },
    created() {
        this.type = this.$route.params.type;
        this.phoneNum=this.$route.params.phoneNum;
        this.inviteCode=this.$route.params.inviteCode;
        this.bindType=this.$route.params.bindType;
    },
    components:{
        backBtn
    }
}
</script>
<style>
    .hb_agreeMent .title{
        font-size: 0.32rem;
        padding-top: 0.9rem;
        padding-bottom: 0.36rem
    }
    .hb_agreeMent .bold{
        font-weight: bold
    }
    .hb_agreeMent .content{
        font-size: 0.28rem;
        line-height: 0.54rem;
        text-align: left;
        padding: 0 0.3rem;
        letter-spacing: 0.01rem
    }
    .hb_agreeMent .p60{
        padding-top: 0.6rem
    }
    .hb_agreeMent .b580{
        padding-bottom: 5.8rem;
    }
</style>